void Can(){
  ReadADC();
  if (C > paramGap1)
  {
    // ปรับซ้าย-ขวา เล็กน้อยให้ตรงทาง (ยังคงเดินหน้าต่อไป)
    if (L > paramGap3)
    {
      // หุ่นห่างกำแพงด้านซ้ายมากเกินไป >> เบี่ยงซ้ายเล็กน้อย
      left();
      forward(Speed, 1);
    }
    else if (L < paramGap2)
    {
      // หุ่นชิดกำแพงด้านซ้ายมากเกินไป >>เบี่ยงขวาเล็กน้อย
      right();
      forward(Speed, 1);
    }
    else
    {
      // ถ้ายังมีที่เดินข้างหน้า >> เดินหน้าต่อไป (แนบกำแพงทางซ้ายเสมอ)
      forward(Speed, 1);
    }
  }
  else
  {
    // ไปข้างหน้าไม่ได้แล้ว >> ตรวจสอบว่าทางขวามีทางเดินหรือไม่
    // [1] ถ้ามีทางเดินทางขวา >> หมุนตัวไปทางขวา
    // [2] ถ้าไม่มี >> กลับหลังหัน
    if (R > paramGap1)
    {
      MotorStop();
      right();
    }
    else
    {
      MotorStop();
      right();
    }
  }

  delay(100);
}
