/* Pattern ของการอ่านเซ็นเซอร์ ขาว-ดำ จะไล่จาก ขวา-ไป-ซ้าย (สีดำ=0 สีขาว=1)

  --------------------------------------------
           ตำแหน่งเซ็นเซอร์ = 7 ตัว
            1 1 1 1 1 1 0
            1 1 1 1 1 0 0
            1 1 1 1 1 0 1
            1 1 1 1 0 0 1 --- Error = ค่าบวก
            1 1 1 1 0 1 1
            1 1 1 0 0 1 1
            1 1 1 0 1 1 1 --- ตรงกลาง
            1 1 0 0 1 1 1
            1 1 0 1 1 1 1
            1 0 0 1 1 1 1 --- Error = ค่าลบ
            1 0 1 1 1 1 1
            0 0 1 1 1 1 1
            0 1 1 1 1 1 1
  --------------------------------------------
           ตำแหน่งเซ็นเซอร์ = 5 ตัว
            1 1 1 1 0
            1 1 1 0 0
            1 1 1 0 1
            1 1 0 0 1
            1 1 0 1 1
            1 0 0 1 1
            1 0 1 1 1
            0 0 1 1 1
            0 1 1 1 1
  --------------------------------------------
           ตำแหน่งเซ็นเซอร์ = 3 ตัว
            1 1 0
            1 0 0
            1 0 1
            0 0 1
            0 1 1
  --------------------------------------------

  Fact
   ในการค่าเซ็นเซอร์คำนวณค่าความผิดพลาดจะในไปใช้ในการแทรกเส้นแบบ PID
  Tip
   จำนวนเซ็นเซอร์ควรมีกว่า 3 ตัว
   จำนวนเซ็นเซอร์ควรเป็นเลขคี่ 3, 5, 7, 9....
   สามารถเซ็ต Argruments การอ่านเซ็นเซอร์ที่แตกต่างจากการแทรกเส้นได้ เช่น การตรวจสอบเส้นตัด
*/

void CalError() {   //การคำนวณ Error
  ConvertADC();    //เปลี่ยนจาก analog เป็็น digital (สีดำ=0 สีขาว=1) (Function มาจากแท็ป ConvertADC)
  if ((L2 == 1) && (L1 == 1) && (R1 == 1) && (R2 == 0)) Error = 3;
  else if ((L2 == 1) && (L1 == 1) && (R1 == 0) && (R2 == 0)) Error = 2;
  else if ((L2 == 1) && (L1 == 1) && (R1 == 0) && (R2 == 1)) Error = 1;
 // else if ((L2 == 1) && (L1 == 0) && (R1 == 0) && (R2 == 1)) Error = 0;
  else if ((L2 == 1) && (L1 == 0) && (R1 == 1) && (R2 == 1)) Error = -1;
  else if ((L2 == 0) && (L1 == 0) && (R1 == 1) && (R2 == 1)) Error = -2;
  else if ((L2 == 0) && (L1 == 1) && (R1 == 1) && (R2 == 0)) Error = -3;

 // else if ((L2 == 1) && (L1 == 1) && (R1 == 1) && (R2 == 1)) Error = 99;   //สิ้นสุดทาง
  else if ((L2 == 0) && (L1 == 0) && (R1 == 0) && (R2 == 0)) Error = 100;  //แยก + T
  //else if ((L2 == 0) && (L1 == 0) ) Error = 101; //แยกซ้าย
  //else if ((R1 == 0) && (R2 == 0) ) Error = 102; //แยกขวา
}
