/*
 wheel(25, -25, 0);  //Forward
  delay(3000);
  ao();
  wheel(-43, 43, 0);  //Backward
  delay(3000);
  ao();
  wheel(68, -18, -50); //ทะแยงซ้ายไปข้างหน้า
  delay(3000);
  ao();
  wheel(-18, 68, -50); //ถอยหลังทะแยงซ้าย
  delay(3000);
  ao();
  wheel(18, -68, 50); //ทะแยงขวาไปข้างหน้า
  delay(3000);
  ao();
  wheel(-68, 18, 50); //ถอยหลังทะแยงขวา
  delay(3000);
  ao();
  wheel(-25, -25, 50);  //ไปทางด้านขวา
  delay(3000);
  ao();
  wheel(25, 25, -50); //ไปทางด้านซ้าย
  delay(3000);
  ao();
  wheel(50, 50, 50); //หมุนซ้าย
  delay(3000);
  ao();
  wheel(-50, -50, -50); //หมุนขวา
  delay(3000);
  ao();
  */
